<?php







$errorList = array(
    101=>'登入超时',
    
    
    301=>'已经登入',
    302=>'手机号已注册',
    
    
    401=>'参数错误',
    402=>'该用户未注册',
    403=>'密码错误',
    404=>'创建用户失败',
    405=>'非法操作',
    406=>'未登入',
    407=>'权限不足',
    408=>'修改密码失败',
    409=>'未找到文章',
    410=>'修改失败',
    411=>'获取失败',
    412=>'没有找到对应的专家',
    413=>'预约失败',
    414=>'解析图片失败',
    415=>'保存图片失败',
    416=>'创建失败',
    417=>'未找到日记',
    418=>'没有上传照片',
    419=>'没有找到对应的工作',
    420=>'没有找到礼品',
    421=>'积分不够',
    422=>'获取用户失败'
);











?>